cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'hashicorp/tap'

#brew 'p7zip'
#brew 'wget'
#brew 'pwgen'
#brew 'tmux'
#brew 'htop'
#brew 'pulumi'
#brew 'git'
#brew 'awscli'
#brew 'hashicorp/tap/vault'
#brew 'k9s'
#brew 'golang'
#brew 'android-studio'
#brew 'cocoapods'
#brew 'java'
brew 'nvm'
brew 'carlocab/personal/unrar'
brew 'imagemagick'
brew 'ffmpeg'
brew 'nmap'
# python management
brew 'pyenv'
brew 'uv'

cask 'google-chrome'
cask 'google-drive'
#cask 'firefox'
#cask 'sublime-text'
cask 'rectangle'
cask 'iterm2'
cask 'spotify'
cask 'stats'
#cask 'docker'
#cask 'webstorm'
#cask 'tunnelblick'
#cask 'goland'
# cask 'dropbox'
#cask 'logseq'
cask 'obsidian'
cask 'steam'
cask 'vlc'
cask '1password'
cask 'visual-studio-code'
cask 'block-goose'
cask 'handbrake-app'
cask 'macfuse'
cask 'cyberduck'
cask 'openmtp'
cask 'dosbox'
cask 'jamulus'
cask 'blackhole-2ch'
cask 'lm-studio'
cask 'ollama-app'
cask 'msty'
cask 'slack'
cask 'claude-code'
cask 'zoom'
