cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/versions'

brew 'unrar'
brew 'nvm'
brew 'postgres'
brew 'wget'
brew 'pwgen'
brew 'tmux'
brew 'htop'

cask 'google-chrome'
cask 'firefox'
cask 'spectacle'
cask 'iterm2'
cask 'sublime-text3'
cask 'macvim'
cask 'chitchat'
cask 'telegram'
cask 'slack'
cask 'skype'
cask 'dockertoolbox'
cask 'vagrant'
cask 'terraform'
cask 'transmission'
cask 'vlc'
cask 'spotify'
cask 'openemu'
cask 'mame'
cask 'steam'
cask 'dropbox'
cask 'python3'
cask 'tunnelblick'
cask 'focuswriter'
cask 'calibre'
