cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/versions'
tap 'homebrew/science'

brew 'unrar'
brew 'nvm'
brew 'postgres'
brew 'wget'
brew 'pwgen'
brew 'tmux'
brew 'htop'
brew 'ruby-build'
brew 'rbenv'
brew 'heroku'
brew 'python'
brew 'python3'
brew 'go'
cask 'xquartz'
brew 'octave'
brew 'gnuplot'

cask 'lastpass'
cask 'google-chrome'
cask 'firefox'
cask 'spectacle'
cask 'iterm2'
cask 'sublime-text3'
cask 'macvim'
cask 'chitchat'
cask 'telegram'
cask 'slack'
cask 'skype'
cask 'dockertoolbox'
cask 'vagrant'
cask 'terraform'
cask 'transmission'
cask 'vlc'
cask 'spotify'
cask 'openemu'
cask 'mame'
cask 'steam'
cask 'dropbox'
cask 'python3'
cask 'tunnelblick'
cask 'focuswriter'
cask 'calibre'
cask 'scummvm'
cask 'dosbox'
cask 'licecap'
cask 'cyberghost'
# wine at osx for games.
#cask 'wineskine-winery'
